# 1 SETUP
***

In [4]:
# Data Analysis
import pandas as pd
import numpy as np

# DataViz 
import matplotlib.pyplot as plt
import seaborn as sns

# Statistical

# Notebook Config 
import sys
import os
proj_root = os.path.abspath(os.path.join(os.getcwd(), '..'))
sys.path.append(proj_root)

# My Functions
from src.utils import df_summary

In [5]:
df_trans = pd.read_csv('../data/raw/train_transaction.csv')
df_id = pd.read_csv('../data/raw/train_identity.csv')

In [24]:
print(df_trans.head())
print(df_id.head())

   TransactionID  isFraud  TransactionDT  TransactionAmt ProductCD  card1  \
0        2987000        0          86400            68.5         W  13926
1        2987001        0          86401            29.0         W   2755
2        2987002        0          86469            59.0         W   4663
3        2987003        0          86499            50.0         W  18132
4        2987004        0          86506            50.0         H   4497

   card2  card3       card4  card5  ... V330  V331  V332  V333  V334 V335  \
0    NaN  150.0    discover  142.0  ...  NaN   NaN   NaN   NaN   NaN  NaN
1  404.0  150.0  mastercard  102.0  ...  NaN   NaN   NaN   NaN   NaN  NaN
2  490.0  150.0        visa  166.0  ...  NaN   NaN   NaN   NaN   NaN  NaN
3  567.0  150.0  mastercard  117.0  ...  NaN   NaN   NaN   NaN   NaN  NaN
4  514.0  150.0  mastercard  102.0  ...  0.0   0.0   0.0   0.0   0.0  0.0

  V336  V337  V338  V339
0  NaN   NaN   NaN   NaN
1  NaN   NaN   NaN   NaN
2  NaN   NaN   NaN   NaN
3  NaN   NaN   NaN   NaN
4  0.0   0.0   0.0   0.0

[5 rows x 394 columns]
   TransactionID  id_01     id_02  id_03  id_04  id_05  id_06  id_07  id_08  \
0        2987004    0.0   70787.0    NaN    NaN    NaN    NaN    NaN    NaN
1        2987008   -5.0   98945.0    NaN    NaN    0.0   -5.0    NaN    NaN
2        2987010   -5.0  191631.0    0.0    0.0    0.0    0.0    NaN    NaN
3        2987011   -5.0  221832.0    NaN    NaN    0.0   -6.0    NaN    NaN
4        2987016    0.0    7460.0    0.0    0.0    1.0    0.0    NaN    NaN

   id_09  ...                id_31  id_32      id_33           id_34  id_35  \
0    NaN  ...  samsung browser 6.2   32.0  2220x1080  match_status:2      T
1    NaN  ...   mobile safari 11.0   32.0   1334x750  match_status:1      T
2    0.0  ...          chrome 62.0    NaN        NaN             NaN      F
3    NaN  ...          chrome 62.0    NaN        NaN             NaN      F
4    0.0  ...          chrome 62.0   24.0   1280x800  match_status:2      T

  id_36 id_37  id_38  DeviceType                     DeviceInfo
0     F     T      T      mobile  SAMSUNG SM-G892A Build/NRD90M
1     F     F      T      mobile                     iOS Device
2     F     T      T     desktop                        Windows
3     F     T      T     desktop                            NaN
4     F     T      T     desktop                          MacOS

[5 rows x 41 columns]

In [6]:
print(f'Transactions: {df_trans.shape}')
print(f'Identity: {df_id.shape}')

Transactions: (590540, 394)
Identity: (144233, 41)

In [7]:
df_trans_summary = df_summary(df_trans)
df_trans_summary[df_trans_summary['Data Null (P%)'] < 80]

         Data Name Data Type  Data Null (A)  Data Null (P%)
294           V240   float64         460110       77.913435
289           V235   float64         460110       77.913435
306           V252   float64         460110       77.913435
303           V249   float64         460110       77.913435
302           V248   float64         460110       77.913435
..             ...       ...            ...             ...
17              C1   float64              0        0.000000
18              C2   float64              0        0.000000
30             C14   float64              0        0.000000
1          isFraud     int64              0        0.000000
0    TransactionID     int64              0        0.000000

[339 rows x 4 columns]

In [8]:
df_id_summary = df_summary(df_id)
df_id_summary[df_id_summary['Data Null (P%)'] < 80]

        Data Name Data Type  Data Null (A)  Data Null (P%)
18          id_18   float64          99120       68.722137
3           id_03   float64          77909       54.016071
4           id_04   float64          77909       54.016071
33          id_33    object          70944       49.187079
9           id_09   float64          69307       48.052110
10          id_10   float64          69307       48.052110
30          id_30    object          66668       46.222432
32          id_32   float64          66647       46.207872
34          id_34    object          66428       46.056034
14          id_14   float64          64189       44.503685
40     DeviceInfo    object          25567       17.726179
13          id_13   float64          16913       11.726165
16          id_16    object          14893       10.325654
6           id_06   float64           7368        5.108401
5           id_05   float64           7368        5.108401
20          id_20   float64           4972        3.447200
19          id_19   float64           4915        3.407681
17          id_17   float64           4864        3.372321
31          id_31    object           3951        2.739318
39     DeviceType    object           3423        2.373243
2           id_02   float64           3361        2.330257
28          id_28    object           3255        2.256765
29          id_29    object           3255        2.256765
11          id_11   float64           3255        2.256765
15          id_15    object           3248        2.251912
35          id_35    object           3248        2.251912
36          id_36    object           3248        2.251912
37          id_37    object           3248        2.251912
38          id_38    object           3248        2.251912
1           id_01   float64              0        0.000000
12          id_12    object              0        0.000000
0   TransactionID     int64              0        0.000000